soburi/openthread_nrf52_arduino/libraries/OpenThread/src/OpenThread.h
  OTBorderRouter BorderRouter;
#endif

#ifdef OPENTHREAD_ENABLE_COMMISSIONER
  class OTCommissioner {
  friend class OpenThreadClass;
  public:
    otError Start(otCommissionerStateCallback, otCommissionerJoinerCallback, void*);
    otError Stop();
    otError AddJoiner(const otExtAddress*, const char*, uint32_t);
    otError RemoveJoiner(const otExtAddress*);
    otError SetProvisioningUrl(const char*);
    otError AnnounceBegin(uint32_t, uint8_t, uint16_t, const otIp6Address*);
    otError EnergyScan(uint32_t, uint8_t, uint16_t, uint16_t, const otIp6Address*, otCommissionerEnergyReportCallback, void*);
    otError PanIdQuery(uint16_t, uint32_t, const otIp6Address*, otCommissionerPanIdConflictCallback, void*);
    otError SendMgmtGet(const uint8_t*, uint8_t);
    otError SendMgmtSet(const otCommissioningDataset*, const uint8_t*, uint8_t);
    uint16_t GetSessionId();
    otCommissionerState GetState();
    otError GeneratePSKc(const char*, const char*, const otExtendedPanId*, uint8_t*);
  };

  OTCommissioner Commissioner;
#endif

  class OTDataset {
  friend class OpenThreadClass;
  public:
    bool IsCommissioned();
    otError GetActive(otOperationalDataset*);
    otError SetActive(const otOperationalDataset*);
    otError GetPending(otOperationalDataset*);
    otError SetPending(const otOperationalDataset*);
    otError SendMgmtActiveGet(const otOperationalDatasetComponents*, const uint8_t*, uint8_t, const otIp6Address*);
    otError SendMgmtActiveSet(const otOperationalDataset*, const uint8_t*, uint8_t);
    otError SendMgmtPendingGet(const otOperationalDatasetComponents*, const uint8_t*, uint8_t, const otIp6Address*);
    otError SendMgmtPendingSet(const otOperationalDataset*, const uint8_t*, uint8_t);
    uint32_t GetDelayTimerMinimal();
    otError SetDelayTimerMinimal(uint32_t);
  };

  OTDataset Dataset;

  class OTError {
  friend class OpenThreadClass;
  public:
    inline const char* ErrorToString(otError err) { return otThreadErrorToString(err); }
  };

  OTError Error;

  class OTInstance {
  friend class OpenThreadClass;
  public:
    otError SetStateChangedCallback(otStateChangedCallback, void*);
    void RemoveStateChangeCallback(otStateChangedCallback, void*);
    void Reset();
    void FactoryReset();
    inline const char* GetVersionString(void) { return otGetVersionString(); }
  };

  OTInstance Instance;

  class OTIp6 {
  friend class OpenThreadClass;
  public:
    otError SetEnabled(bool);
    bool IsEnabled();
    otError AddUnicastAddress(const otNetifAddress*);
    otError RemoveUnicastAddress(const otIp6Address*);
    const otNetifAddress* GetUnicastAddresses();

    static inline bool IsAddressEqual(const otIp6Address* a1, const otIp6Address* a2)
    {
      return otIp6IsAddressEqual(a1, a2);
    }
    static inline otError AddressFromString(const char* str, otIp6Address* addr)
    {
      return otIp6AddressFromString(str, addr);
    }
    uint8_t PrefixMatch(const otIp6Address* addr1, const otIp6Address* addr2)
    {
      return otIp6PrefixMatch(addr1, addr2);
    }
  };

  OTIp6 Ip6;

#ifdef OPENTHREAD_ENABLE_JOINER
  class OTJoiner {
  friend class OpenThreadClass;
  public:
    otError Start(const char*, const char*, const char*, const char*, const char*, const char*, otJoinerCallback, void*);
    otError Stop();
    otJoinerState GetState();
    otError GetId(otExtAddress*);
  };

  OTJoiner Joiner;
#endif

  class OTLink {
  friend class OpenThreadClass;
  public:
    otError ActiveScan(uint32_t, uint16_t, otHandleActiveScanResult, void*);
    bool IsActiveScanInProgress();
    otError EnergyScan(uint32_t, uint16_t, otHandleEnergyScanResult, void*);
    bool IsEnergyScanInProgress();
    otError SendDataRequest();
    bool IsInTransmitState();
    otError OutOfBandTransmitRequest(otRadioFrame*);
    uint8_t GetChannel();
    otError SetChannel(uint8_t);
    const otExtAddress* GetExtendedAddress();
    otError SetExtendedAddress(const otExtAddress*);
    void GetFactoryAssignedIeeeEui64(otExtAddress*);
    otPanId GetPanId();
    otError SetPanId(otPanId);
    uint32_t GetPollPeriod();
    otError SetPollPeriod(uint32_t);
    otShortAddress GetShortAddress();
    otMacFilterAddressMode FilterGetAddressMode();
    otError FilterSetAddressMode(otMacFilterAddressMode);
    otError FilterAddAddress(const otExtAddress*);
    otError FilterRemoveAddress(const otExtAddress*);
    void FilterClearAddresses();
    otError FilterGetNextAddress(otMacFilterIterator*, otMacFilterEntry*);
    otError FilterAddRssIn(const otExtAddress*, int8_t);
    otError FilterRemoveRssIn(const otExtAddress*);
    void FilterClearRssIn();
    otError FilterGetNextRssIn(otMacFilterIterator*, otMacFilterEntry*);
    const otMacCounters* GetCounters();
  };

  OTLink Link;

  class OTMessage {
  friend class OpenThreadClass;
  public:
    void GetBufferInfo(otBufferInfo*);
  };

  OTMessage Message;

  class OTNetData {
  friend class OpenThreadClass;
  public:
    otError Get(bool, uint8_t*, uint8_t*);
    otError GetNextOnMeshPrefix(otNetworkDataIterator*, otBorderRouterConfig*);
    uint8_t GetVersion();
    uint8_t GetStableVersion();
  };

  OTNetData NetData;

#ifdef OPENTHREAD_ENABLE_JOINER
  class OTServer {
  friend class OpenThreadClass;
  public:
    otError GetNetDataLocal(bool, uint8_t*, uint8_t*);
    otError AddService(const otServiceConfig*);
    otError RemoveService(uint32_t, uint8_t*, uint8_t);
    otError GetNextService(otNetworkDataIterator*, otServiceConfig*);
    otError GetNextLeaderService(otNetworkDataIterator*, otServiceConfig*);
    otError Register();
  };

  OTServer Server;
#endif

  class OTThread {
  friend class OpenThreadClass;
  public:
    otError SetEnabled(bool aEnabled);
    bool IsSingleton();

    otError Discover(uint32_t aScanChannels, uint16_t aPanId, bool aJoiner, bool aEnableEui64Filtering, otHandleActiveScanResult aCallback, void* aCallbackContext);

    bool IsDiscoverInProgress();
    uint32_t GetChildTimeout();
    void SetChildTimeout(uint32_t aTimeout);
    const otExtendedPanId* GetExtendedPanId();
    otError SetExtendedPanId(const otExtendedPanId *aExtendedPanId);
    otError GetLeaderRloc(otIp6Address *aLeaderRloc);
    otLinkModeConfig GetLinkMode();
    otError SetLinkMode(otLinkModeConfig aConfig);
    const otMasterKey* GetMasterKey();
    otError SetMasterKey(const otMasterKey *aKey);
    const otIp6Address* GetMeshLocalEid();
    const otMeshLocalPrefix* GetMeshLocalPrefix();
    otError SetMeshLocalPrefix(const otMeshLocalPrefix *aMeshLocalPrefix);
    const char* GetNetworkName();
    otError SetNetworkName(const char *aNetworkName);
    uint32_t GetKeySequenceCounter();
    void SetKeySequenceCounter(uint32_t aKeySequenceCounter);
    uint32_t GetKeySwitchGuardTime();
    void SetKeySwitchGuardTime(uint32_t aKeySwitchGuardTime);
    otError BecomeDetached();
    otError BecomeChild();
    otError GetNextNeighborInfo(otNeighborInfoIterator *aIterator, otNeighborInfo * aInfo);
    otDeviceRole GetDeviceRole();
    otError GetLeaderData(otLeaderData *aLeaderData);
    uint8_t GetLeaderRouterId();
    uint8_t GetLeaderWeight();
    uint32_t GetPartitionId();
    uint16_t GetRloc16();
    otError GetParentInfo(otRouterInfo *aParentInfo);
    otError GetParentAverageRssi(int8_t *aParentRssi);
    otError GetParentLastRssi(int8_t *aLastRssi);
    otError SendDiagnosticGet(const otIp6Address *aDestination, const uint8_t aTlvTypes[], uint8_t aCount);
    otError SendDiagnosticReset(const otIp6Address *aDestination, const uint8_t aTlvTypes[], uint8_t aCount);
    const otIpCounters* GetIp6Counters();

    otError RegisterParentResponseCallback(otThreadParentResponseCallback aCallback, void* aContext);

    uint8_t GetMaxAllowedChildren();
    otError SetMaxAllowedChildren(uint8_t aMaxChildren);
    bool IsRouterRoleEnabled();
    void SetRouterRoleEnabled(bool aEnabled);
    otError SetPreferredRouterId(uint8_t aRouterId);
    uint8_t GetLocalLeaderWeight();
    void SetLocalLeaderWeight(uint8_t aWeight);
    uint32_t GetLocalLeaderPartitionId();
    void SetLocalLeaderPartitionId(uint32_t aPartitionId);
    uint16_t GetJoinerUdpPort();
    otError SetJoinerUdpPort(uint16_t aJoinerUdpPort);
    uint32_t GetContextIdReuseDelay();
    void SetContextIdReuseDelay(uint32_t aDelay);
    uint8_t GetNetworkIdTimeout();
    void SetNetworkIdTimeout(uint8_t aTimeout);
    uint8_t GetRouterUpgradeThreshold();
    void SetRouterUpgradeThreshold(uint8_t aThreshold);
    otError ReleaseRouterId(uint8_t aRouterId);
    otError BecomeRouter();
    otError BecomeLeader();
    uint8_t GetRouterDowngradeThreshold();
    void SetRouterDowngradeThreshold(uint8_t aThreshold);
    uint8_t GetRouterSelectionJitter();
    void SetRouterSelectionJitter(uint8_t aRouterJitter);
    otError GetChildInfoById(uint16_t aChildId, otChildInfo *aChildInfo);
    otError GetChildInfoByIndex(uint8_t aChildIndex, otChildInfo *aChildInfo);
    uint8_t GetRouterIdSequence();
    uint8_t GetMaxRouterId();
    otError GetRouterInfo(uint16_t aRouterId, otRouterInfo *aRouterInfo);
    otError GetEidCacheEntry(uint8_t aIndex, otEidCacheEntry *aEntry);
    const otPSKc* GetPSKc();
    otError SetPSKc(const otPSKc *aPSKc);
    int8_t GetParentPriority();
    otError SetParentPriority(int8_t aParentPriority);
  };

  OTThread Thread;

private:


  struct discover_data {
    //struct k_sem sem;
    otError error;
    otActiveScanResult* table;
    size_t size;
    size_t count;
  };
  struct discover_data sync_discover_context;

  static void joiner_start_sync_callback(otError aResult, void *aContext);
  static void discover_sync_callback(otActiveScanResult *aResult, void *aContext);
};

extern OpenThreadClass OpenThread;

#endif
